It really seems to act like you said. Please find below the outputs.

**terraform plan**
```
2021/02/12 16:36:17 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/02/12 16:36:17 [INFO] Terraform version: 0.14.3
2021/02/12 16:36:17 [INFO] Go runtime version: go1.15.2
2021/02/12 16:36:17 [INFO] CLI args: []string{"/usr/bin/terraform", "plan"}
2021/02/12 16:36:17 [DEBUG] Attempting to open CLI config file: /home/deepblue/.terraformrc
2021/02/12 16:36:17 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory /home/deepblue/.terraform.d/plugins
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory /home/deepblue/.local/share/terraform/plugins
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2021/02/12 16:36:17 [DEBUG] ignoring non-existing provider search directory /var/lib/snapd/desktop/terraform/plugins
2021/02/12 16:36:17 [INFO] CLI command args: []string{"plan"}
2021/02/12 16:36:17 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/02/12 16:36:17 [DEBUG] New state was assigned lineage "bd06519a-0942-01b7-7eff-4eb133d5e990"
2021/02/12 16:36:18 [DEBUG] checking for provisioner in "."
2021/02/12 16:36:18 [DEBUG] checking for provisioner in "/usr/bin"
2021/02/12 16:36:18 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2021/02/12 16:36:18 [INFO] backend/local: starting Plan operation
2021-02-12T16:36:18.058+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:36:18.082+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:36:18.082+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7380
2021-02-12T16:36:18.082+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:36:18.095+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:36:18.094+0100
2021-02-12T16:36:18.140+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: address=/tmp/plugin579008383 network=unix timestamp=2021-02-12T16:36:18.140+0100
2021-02-12T16:36:18.140+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:36:18.204+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:36:18.205+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7380
2021-02-12T16:36:18.205+0100 [DEBUG] plugin: plugin exited
2021/02/12 16:36:18 [INFO] terraform: building graph: GraphTypeValidate
2021/02/12 16:36:18 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/terraform-provider-openstack/openstack"], implied first by openstack_compute_instance_v2.instance
2021/02/12 16:36:18 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:36:18 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terraform-provider-openstack/openstack\"]" references: []
2021/02/12 16:36:18 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance" references: []
2021/02/12 16:36:18 [DEBUG] Starting graph walk: walkValidate
2021-02-12T16:36:18.208+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:36:18.233+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:36:18.233+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7393
2021-02-12T16:36:18.233+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:36:18.253+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:36:18.253+0100
2021-02-12T16:36:18.279+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:36:18.279+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: network=unix address=/tmp/plugin663146588 timestamp=2021-02-12T16:36:18.279+0100
2021-02-12T16:36:18.353+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:36:18.354+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7393
2021-02-12T16:36:18.354+0100 [DEBUG] plugin: plugin exited
2021/02/12 16:36:18 [INFO] backend/local: plan calling Plan
2021/02/12 16:36:18 [INFO] terraform: building graph: GraphTypePlan
2021/02/12 16:36:18 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/terraform-provider-openstack/openstack"], implied first by openstack_compute_instance_v2.instance (expand)
2021/02/12 16:36:18 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:36:18 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance (expand)" references: []
2021/02/12 16:36:18 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terraform-provider-openstack/openstack\"]" references: []
2021/02/12 16:36:18 [DEBUG] Starting graph walk: walkPlan
2021-02-12T16:36:18.355+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:36:18.381+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:36:18.381+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7406
2021-02-12T16:36:18.381+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:36:18.394+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:36:18.394+0100
2021-02-12T16:36:18.422+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: address=/tmp/plugin685472273 network=unix timestamp=2021-02-12T16:36:18.422+0100
2021-02-12T16:36:18.422+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:36:18.491+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:36:18 [DEBUG] OpenStack allowReauth: true
2021/02/12 16:36:18 [DEBUG] Resource instance state not found for node "openstack_compute_instance_v2.instance", instance openstack_compute_instance_v2.instance
2021/02/12 16:36:18 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance" references: []
2021/02/12 16:36:18 [DEBUG] refresh: openstack_compute_instance_v2.instance: no state, so not refreshing
2021/02/12 16:36:18 [WARN] Provider "registry.terraform.io/terraform-provider-openstack/openstack" produced an invalid plan for openstack_compute_instance_v2.instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .stop_before_destroy: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .power_state: planned value cty.StringVal("active") does not match config value cty.NullVal(cty.String)
      - .network[0].access_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021-02-12T16:36:18.497+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:36:18.497+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7406
2021-02-12T16:36:18.497+0100 [DEBUG] plugin: plugin exited
2021/02/12 16:36:18 [INFO] backend/local: plan operation completed

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_instance_v2.instance will be created
  + resource "openstack_compute_instance_v2" "instance" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "s1-2"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "Ubuntu 20.04"
      + name                = "tf_test"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "Ext-Net"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

**terraform apply**
```
2021/02/12 16:40:01 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/02/12 16:40:01 [INFO] Terraform version: 0.14.3
2021/02/12 16:40:01 [INFO] Go runtime version: go1.15.2
2021/02/12 16:40:01 [INFO] CLI args: []string{"/usr/bin/terraform", "apply"}
2021/02/12 16:40:01 [DEBUG] Attempting to open CLI config file: /home/deepblue/.terraformrc
2021/02/12 16:40:01 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory /home/deepblue/.terraform.d/plugins
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory /home/deepblue/.local/share/terraform/plugins
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2021/02/12 16:40:01 [DEBUG] ignoring non-existing provider search directory /var/lib/snapd/desktop/terraform/plugins
2021/02/12 16:40:01 [INFO] CLI command args: []string{"apply"}
2021/02/12 16:40:01 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/02/12 16:40:01 [DEBUG] New state was assigned lineage "ffd06ac9-6cd2-4c28-408a-00988d1fc200"
2021/02/12 16:40:01 [DEBUG] checking for provisioner in "."
2021/02/12 16:40:01 [DEBUG] checking for provisioner in "/usr/bin"
2021/02/12 16:40:01 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2021/02/12 16:40:01 [INFO] backend/local: starting Apply operation
2021-02-12T16:40:01.253+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:40:01.284+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:40:01.284+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7507
2021-02-12T16:40:01.284+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:40:01.295+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:40:01.295+0100
2021-02-12T16:40:01.322+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: address=/tmp/plugin092075206 network=unix timestamp=2021-02-12T16:40:01.322+0100
2021-02-12T16:40:01.322+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:40:01.385+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:40:01.386+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7507
2021-02-12T16:40:01.387+0100 [DEBUG] plugin: plugin exited
2021/02/12 16:40:01 [INFO] terraform: building graph: GraphTypeValidate
2021/02/12 16:40:01 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/terraform-provider-openstack/openstack"], implied first by openstack_compute_instance_v2.instance
2021/02/12 16:40:01 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:40:01 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terraform-provider-openstack/openstack\"]" references: []
2021/02/12 16:40:01 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance" references: []
2021/02/12 16:40:01 [DEBUG] Starting graph walk: walkValidate
2021-02-12T16:40:01.388+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:40:01.412+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:40:01.413+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7520
2021-02-12T16:40:01.413+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:40:01.425+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:40:01.424+0100
2021-02-12T16:40:01.459+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: address=/tmp/plugin143259615 network=unix timestamp=2021-02-12T16:40:01.459+0100
2021-02-12T16:40:01.459+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:40:01.537+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:40:01.538+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7520
2021-02-12T16:40:01.538+0100 [DEBUG] plugin: plugin exited
2021/02/12 16:40:01 [INFO] backend/local: apply calling Plan
2021/02/12 16:40:01 [INFO] terraform: building graph: GraphTypePlan
2021/02/12 16:40:01 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/terraform-provider-openstack/openstack"], implied first by openstack_compute_instance_v2.instance (expand)
2021/02/12 16:40:01 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:40:01 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance (expand)" references: []
2021/02/12 16:40:01 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terraform-provider-openstack/openstack\"]" references: []
2021/02/12 16:40:01 [DEBUG] Starting graph walk: walkPlan
2021-02-12T16:40:01.539+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:40:01.565+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:40:01.566+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7534
2021-02-12T16:40:01.566+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:40:01.642+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:40:01.641+0100
2021-02-12T16:40:01.671+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: network=unix address=/tmp/plugin984519521 timestamp=2021-02-12T16:40:01.671+0100
2021-02-12T16:40:01.671+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:40:01.735+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:01 [DEBUG] OpenStack allowReauth: true
2021/02/12 16:40:01 [DEBUG] Resource instance state not found for node "openstack_compute_instance_v2.instance", instance openstack_compute_instance_v2.instance
2021/02/12 16:40:01 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance" references: []
2021/02/12 16:40:01 [DEBUG] refresh: openstack_compute_instance_v2.instance: no state, so not refreshing
2021/02/12 16:40:01 [WARN] Provider "registry.terraform.io/terraform-provider-openstack/openstack" produced an invalid plan for openstack_compute_instance_v2.instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .power_state: planned value cty.StringVal("active") does not match config value cty.NullVal(cty.String)
      - .stop_before_destroy: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .force_delete: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .network[0].access_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021-02-12T16:40:01.741+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:40:01.742+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7534
2021-02-12T16:40:01.742+0100 [DEBUG] plugin: plugin exited

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

2021/02/12 16:40:01 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  # openstack_compute_instance_v2.instance will be created
  + resource "openstack_compute_instance_v2" "instance" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "s1-2"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "Ubuntu 20.04"
      + name                = "tf_test"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "Ext-Net"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2021/02/12 16:40:02 [INFO] backend/local: apply calling Apply
2021/02/12 16:40:02 [INFO] terraform: building graph: GraphTypeApply
2021/02/12 16:40:02 [DEBUG] Resource state not found for node "openstack_compute_instance_v2.instance", instance openstack_compute_instance_v2.instance
2021/02/12 16:40:02 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/terraform-provider-openstack/openstack"], implied first by openstack_compute_instance_v2.instance
2021/02/12 16:40:02 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:40:02 [DEBUG] ProviderTransformer: "openstack_compute_instance_v2.instance" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/terraform-provider-openstack/openstack"]
2021/02/12 16:40:02 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terraform-provider-openstack/openstack\"]" references: []
2021/02/12 16:40:02 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance (expand)" references: []
2021/02/12 16:40:02 [DEBUG] ReferenceTransformer: "openstack_compute_instance_v2.instance" references: []
2021/02/12 16:40:02 [DEBUG] Starting graph walk: walkApply
2021-02-12T16:40:02.972+0100 [INFO]  plugin: configuring client automatic mTLS
2021-02-12T16:40:03.002+0100 [DEBUG] plugin: starting plugin: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 args=[.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0]
2021-02-12T16:40:03.002+0100 [DEBUG] plugin: plugin started: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7547
2021-02-12T16:40:03.002+0100 [DEBUG] plugin: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0
2021-02-12T16:40:03.027+0100 [INFO]  plugin.terraform-provider-openstack_v1.37.0: configuring server automatic mTLS: timestamp=2021-02-12T16:40:03.026+0100
2021-02-12T16:40:03.051+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: plugin address: address=/tmp/plugin858558050 network=unix timestamp=2021-02-12T16:40:03.051+0100
2021-02-12T16:40:03.052+0100 [DEBUG] plugin: using plugin: version=5
2021-02-12T16:40:03.116+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:03 [DEBUG] OpenStack allowReauth: true
2021/02/12 16:40:03 [WARN] Provider "registry.terraform.io/terraform-provider-openstack/openstack" produced an invalid plan for openstack_compute_instance_v2.instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .power_state: planned value cty.StringVal("active") does not match config value cty.NullVal(cty.String)
      - .stop_before_destroy: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .network[0].access_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
openstack_compute_instance_v2.instance: Creating...
2021/02/12 16:40:03 [DEBUG] EvalApply: ProviderMeta config value set
2021/02/12 16:40:03 [DEBUG] openstack_compute_instance_v2.instance: applying the planned Create change
2021-02-12T16:40:03.122+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:03 [DEBUG] setting computed for "all_tags" from ComputedKeys
2021-02-12T16:40:03.122+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:03 [DEBUG] setting computed for "all_metadata" from ComputedKeys
2021-02-12T16:40:03.122+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:03 [DEBUG] Locking "auth"
2021-02-12T16:40:03.122+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:03 [DEBUG] Locked "auth"
2021-02-12T16:40:08.006+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:08 [DEBUG] Unlocking "auth"
2021-02-12T16:40:08.006+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:08 [DEBUG] Unlocked "auth"
2021-02-12T16:40:08.006+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:08 [DEBUG] OpenStack Region is: GRA3
2021-02-12T16:40:08.006+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:08 [DEBUG] OpenStack Endpoint for compute: https://compute.gra3.cloud.ovh.net/v2.1/cde857dd879446f2b05ac9da8c1ede42/
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] Create with specified network options
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] Locking "auth"
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] Locked "auth"
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] Unlocking "auth"
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] Unlocked "auth"
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] OpenStack Region is: GRA3
2021-02-12T16:40:09.824+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:09 [DEBUG] OpenStack Endpoint for network: https://network.compute.gra3.cloud.ovh.net/v2.0/
2021-02-12T16:40:10.855+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:10 [DEBUG] getInstanceNetworkInfoNeutron: map[string]interface {}{"name":"Ext-Net", "uuid":"eecc8610-f977-461c-bad2-917d7be01144"}
2021-02-12T16:40:10.855+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:10 [DEBUG] getAllInstanceNetworks: []openstack.InstanceNetwork{openstack.InstanceNetwork{UUID:"eecc8610-f977-461c-bad2-917d7be01144", Name:"Ext-Net", Port:"", FixedIP:"", AccessNetwork:false}}
2021-02-12T16:40:10.856+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:10 [DEBUG] Create Options: &servers.CreateOpts{Name:"tf_test", ImageRef:"3903fd23-da13-476f-af78-9756b6557118", FlavorRef:"eeb4ccc9-faa0-4afb-955e-6a0224f93055", SecurityGroups:[]string{"default"}, UserData:[]uint8{}, AvailabilityZone:"", Networks:[]servers.Network{servers.Network{UUID:"eecc8610-f977-461c-bad2-917d7be01144", Port:"", FixedIP:""}}, Metadata:map[string]string{}, Personality:servers.Personality(nil), ConfigDrive:(*bool)(0xc00063e989), AdminPass:"", AccessIPv4:"", AccessIPv6:"", Min:0, Max:0, Tags:[]string{}}
2021-02-12T16:40:11.983+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:11 [INFO] Instance ID: f86b5c08-4f04-46c9-904b-043ca94c9a1d
2021-02-12T16:40:11.983+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:11 [DEBUG] Waiting for instance (f86b5c08-4f04-46c9-904b-043ca94c9a1d) to become running
2021-02-12T16:40:11.983+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:11 [DEBUG] Waiting for state to become: [ACTIVE]
openstack_compute_instance_v2.instance: Still creating... [10s elapsed]
2021-02-12T16:40:22.555+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:22 [TRACE] Waiting 3s before next try
openstack_compute_instance_v2.instance: Still creating... [20s elapsed]
2021-02-12T16:40:26.137+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:26 [TRACE] Waiting 6s before next try
2021-02-12T16:40:32.549+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:32 [TRACE] Waiting 10s before next try
openstack_compute_instance_v2.instance: Still creating... [30s elapsed]
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] Locking "auth"
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] Locked "auth"
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] Unlocking "auth"
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] Unlocked "auth"
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] OpenStack Region is: GRA3
2021-02-12T16:40:42.906+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:42 [DEBUG] OpenStack Endpoint for compute: https://compute.gra3.cloud.ovh.net/v2.1/cde857dd879446f2b05ac9da8c1ede42/
openstack_compute_instance_v2.instance: Still creating... [40s elapsed]
2021-02-12T16:40:43.233+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Retrieved Server f86b5c08-4f04-46c9-904b-043ca94c9a1d: &{ID:f86b5c08-4f04-46c9-904b-043ca94c9a1d TenantID:cde857dd879446f2b05ac9da8c1ede42 UserID:73520840bdd44112b37ae43db93bd4b4 Name:tf_test Updated:2021-02-12 15:40:41 +0000 UTC Created:2021-02-12 15:40:11 +0000 UTC HostID:66907ed815a6d4e00a9b0af13850dabc1b4304f21a9ce628b2fe916d Status:ACTIVE Progress:0 AccessIPv4: AccessIPv6: Image:map[id:3903fd23-da13-476f-af78-9756b6557118 links:[map[href:https://compute.gra3.cloud.ovh.net/cde857dd879446f2b05ac9da8c1ede42/images/3903fd23-da13-476f-af78-9756b6557118 rel:bookmark]]] Flavor:map[id:eeb4ccc9-faa0-4afb-955e-6a0224f93055 links:[map[href:https://compute.gra3.cloud.ovh.net/cde857dd879446f2b05ac9da8c1ede42/flavors/eeb4ccc9-faa0-4afb-955e-6a0224f93055 rel:bookmark]]] Addresses:map[Ext-Net:[map[OS-EXT-IPS-MAC:mac_addr:fa:16:3e:05:71:b3 OS-EXT-IPS:type:fixed addr:147.135.194.193 version:4] map[OS-EXT-IPS-MAC:mac_addr:fa:16:3e:05:71:b3 OS-EXT-IPS:type:fixed addr:2001:41d0:302:1100::af3 version:6]]] Metadata:map[] Links:[map[href:https://compute.gra3.cloud.ovh.net/v2.1/cde857dd879446f2b05ac9da8c1ede42/servers/f86b5c08-4f04-46c9-904b-043ca94c9a1d rel:self] map[href:https://compute.gra3.cloud.ovh.net/cde857dd879446f2b05ac9da8c1ede42/servers/f86b5c08-4f04-46c9-904b-043ca94c9a1d rel:bookmark]] KeyName: AdminPass: SecurityGroups:[map[name:default]] AttachedVolumes:[] Fault:{Code:0 Created:0001-01-01 00:00:00 +0000 UTC Details: Message:} Tags:<nil>}
2021-02-12T16:40:43.233+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Locking "auth"
2021-02-12T16:40:43.233+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Locked "auth"
2021-02-12T16:40:43.234+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Unlocking "auth"
BUG] Unlocked "auth"
2021-02-12T16:40:43.234+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] OpenStack Region is: GRA3
2021-02-12T16:40:43.234+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] OpenStack Endpoint for compute: https://compute.gra3.cloud.ovh.net/v2.1/cde857dd879446f2b05ac9da8c1ede42/
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Addresses: map[string]interface {}{"Ext-Net":[]interface {}{map[string]interface {}{"OS-EXT-IPS-MAC:mac_addr":"fa:16:3e:05:71:b3", "OS-EXT-IPS:type":"fixed", "addr":"147.135.194.193", "version":4}, map[string]interface {}{"OS-EXT-IPS-MAC:mac_addr":"fa:16:3e:05:71:b3", "OS-EXT-IPS:type":"fixed", "addr":"2001:41d0:302:1100::af3", "version":6}}}
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] allInstanceAddresses: []openstack.InstanceAddresses{openstack.InstanceAddresses{NetworkName:"Ext-Net", InstanceNICs:[]openstack.InstanceNIC{openstack.InstanceNIC{FixedIPv4:"147.135.194.193", FixedIPv6:"[2001:41d0:302:1100::af3]", MAC:"fa:16:3e:05:71:b3"}}}}
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Locking "auth"
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Locked "auth"
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Unlocking "auth"
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] Unlocked "auth"
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] OpenStack Region is: GRA3
2021-02-12T16:40:43.572+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:43 [DEBUG] OpenStack Endpoint for network: https://network.compute.gra3.cloud.ovh.net/v2.0/
2021-02-12T16:40:45.261+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:45 [DEBUG] getInstanceNetworkInfoNeutron: map[string]interface {}{"name":"Ext-Net", "uuid":"eecc8610-f977-461c-bad2-917d7be01144"}
2021-02-12T16:40:45.262+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:45 [DEBUG] getAllInstanceNetworks: []openstack.InstanceNetwork{openstack.InstanceNetwork{UUID:"eecc8610-f977-461c-bad2-917d7be01144", Name:"Ext-Net", Port:"", FixedIP:"", AccessNetwork:false}}
2021-02-12T16:40:45.262+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:45 [DEBUG] flattenInstanceNetworks: []map[string]interface {}{map[string]interface {}{"access_network":false, "fixed_ip_v4":"147.135.194.193", "fixed_ip_v6":"[2001:41d0:302:1100::af3]", "mac":"fa:16:3e:05:71:b3", "name":"Ext-Net", "port":"", "uuid":"eecc8610-f977-461c-bad2-917d7be01144"}}
2021-02-12T16:40:45.262+0100 [DEBUG] plugin.terraform-provider-openstack_v1.37.0: 2021/02/12 16:40:45 [DEBUG] OpenStack Instance Network Access Addresses: 147.135.194.193, [2001:41d0:302:1100::af3]
2021/02/12 16:40:46 [WARN] Provider "registry.terraform.io/terraform-provider-openstack/openstack" produced an unexpected new value for openstack_compute_instance_v2.instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .key_pair: was null, but now cty.StringVal("")
openstack_compute_instance_v2.instance: Creation complete after 43s [id=f86b5c08-4f04-46c9-904b-043ca94c9a1d]
2021-02-12T16:40:46.115+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-12T16:40:46.117+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/terraform-provider-openstack/openstack/1.37.0/linux_amd64/terraform-provider-openstack_v1.37.0 pid=7547
2021-02-12T16:40:46.117+0100 [DEBUG] plugin: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```